{
  "semester": "Spring 2025",
  "topic": "chromatic homotopy theory",
  "meeting": "4:15pm on Tuesdays in Harvard SC 309 (unless otherwise noted)",
  "calendarLink": "https://calendar.google.com/calendar",
  "organizer": "Matthew Niemiro",
  "talks": [
    {
      "date": "Feb 18",
      "year": "2025",
      "title": "Descent, Adams spectral sequences, and further Spec(MU)lation",
      "speaker": "Keita Allen",
      "affiliation": "MIT",
      "abstract": "The theory of (faithfully flat) descent provides a way of understanding a ring in terms of an algebra over it, which can be very useful when the base ring is complicated. An analogue of these ideas in the stable homotopy category, where we consider ring spectra and algebras over them, leads to the Adams spectral sequence; we obtain a systematic way of studying the sphere spectrum by \"resolving\" it in terms of another, easier to understand, ring spectrum. A surprising discovery of Quillen tells us that when we use the complex cobordism spectrum MU to resolve the sphere, we obtain a spectral sequence with input coming from the purely algebraic theory of formal groups. This provides another plan of attack for understanding the homotopy groups of spheres, and stable homotopy theory more broadly; understanding how formal groups are organized can in turn help us understand how homotopy theory is organized. This turns out to be very effective, and is the basis for what has become known as chromatic homotopy theory. In my talk, I will give an overview of how some of these ideas are developed, emphasizing the analogy with algebra, and highlight some important characters who we will be seeing later."
    },
    {
      "date": "Feb 25",
      "year": "2025",
      "title": "Spectra and formal groups",
      "speaker": "Oakley Edens",
      "affiliation": "Harvard",
      "abstract": "In the previous talk, we saw that the behaviour of the complex cobordism spectrum MU controls homotopy groups of spheres via the Adams-Novikov spectral sequence. In this talk, I will further discuss how MU can be used to relate topology and algebra via formal group laws. This will lead to defining the moduli stack of formal groups, which will be a central focus of the remaining talks. Finally, via the theory of Hopf algebroids, we will show how one can associate, to any spectrum, certain quasi-coherent sheaves on the moduli stack of formal groups."
    },
    {
      "date": "Mar 4",
      "year": "2025",
      "title": "Stack to the Future",
      "speaker": "Tyler Lane",
      "affiliation": "Harvard",
      "abstract": "As the title suggests, this talk is all about the moduli stack of formal groups. I'll begin by presenting the moduli stack of formal groups as a quotient stack. Then I'll discuss the height filtration and some of its basic properties. One of my main goals is to present some theorems about quasi-coherent sheaves on the stack of formal group which will serve as inspiration for some corresponding results in chromatic homotopy theory. Finally I will discuss the Landweber exact functor theorem."
    }
  ]
}